src/Enums/ВариантыSMTPАутентификации/ВариантыSMTPАутентификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыSMTPАутентификации</name>
  <enumValues>
    <name>АналогичноPOP3</name>
  </enumValues>
  <enumValues>
    <name>ЗадаетсяПараметрами</name>
  </enumValues>
  <enumValues>
    <name>POP3ПередSMTP</name>
  </enumValues>
  <enumValues>
    <name>НеЗадано</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыSMTPАутентификации/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.НеЗадано);
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами);
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.АналогичноPOP3);	
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.POP3ПередSMTP);	
		
КонецПроцедуры
